{
    "users": [
        {
            "id": "1",
            "name": "Bairon",
            "lastName": "Freire otalvaro",
            "cellPhone": "(+57) 322-568-7135",
            "address": "Cra 28B2 72F 146 Comuneros 2",
            "username":"bairon.freire",
            "email":"bairon.f5@gmail.com",
            "profile": "Desarrollador Full stack con más de 8 años de experiencia en el ámbito de desarrollo web y soluciones tecnológicas. Especializado en el diseño e implementación de microservicios en entornos de nube, con un enfoque en la eficiencia y la escalabilidad. Poseo habilidades sólidas en diversos lenguajes de programación como Node.js, Java y Python, así como experiencia práctica en el despliegue y gestión de aplicaciones en plataformas en la nube, especialmente AWS. Mi trayectoria profesional abarca tanto el desarrollo del Frontend como del Backend, con experiencia destacada en proyectos utilizando el framework Angular 12+ . He desempeñado roles clave en proyectos estratégicos, destacándome en la integración de sistemas complejos y en la resolución de desafíos técnicos. Me caracterizo por seguir las mejores prácticas de metodologías ágiles como Scrum, priorizando la calidad del código y la entrega temprana de los productos. Mi compromiso con la excelencia se refleja en cada fase del desarrollo, contribuyendo significativamente al logro de los objetivos del equipo y la satisfacción del cliente.",
            "city":"Cali",
            "department": "Valle del Cauca",
            "country": "Colombia",
            "role": "Full stack developer"
        }
    ],
    "experiences": [
        {
            "id": "1",
            "title": "Senior Analyst - Backend Developer",
            "company": "Accenture",
            "startDate": "01/09/2021",
            "endDate": "01/12/2023",
            "description": "Contribuí como Desarrollador de Backend en el proyecto BAM para Bancolombia en Guatemala, desempeñando un papel destacado en la implementación de microservicios en la nube de AWS. Participé de manera remota desde Bogotá en un entorno ágil (Scrum), priorizando la eficiencia y la obtención de resultados tangibles. Encabecé el desarrollo de 30 microservicios en AWS, logrando una mejora del 20% en la eficiencia del sistema, medido a través de métricas de rendimiento y tiempos de respuesta. Me encargué de la implementación de pipelines y procesos de release en Azure, generando un aumento del 15% en la velocidad de entrega del proyecto. Haciendo uso de tecnologías como Serverless, Node.js y TypeScript, diseñé servicios escalables y de alto rendimiento para satisfacer las necesidades del proyecto. Elaboré diagramas detallados para mejorar la comprensión del sistema, facilitando la comunicación entre los miembros del equipo.",
            "country": "CO",
            "department": "VALLE_DEL_CAUCA",
            "city": "CALI"
        }
    ]

}